Microchip-MPLAB-Harmony/wireless_apps_pic32cxbz2_wbz45/apps/multiprotocol/ble_zigbee_light_prov_wbz450/firmware/src/packs/WBZ450_DFP/component/dmt.h
/* -------- DMT_DMTCLRSET : (DMT Offset: 0x28) (R/W 32) Bit set register -------- */
#define DMT_DMTCLRSET_RESETVALUE              _UINT32_(0x00)                                       /*  (DMT_DMTCLRSET) Bit set register  Reset Value */

#define DMT_DMTCLRSET_Msk                     _UINT32_(0x00000000)                                 /* (DMT_DMTCLRSET) Register Mask  */


/* -------- DMT_DMTCLRINV : (DMT Offset: 0x2C) (R/W 32) Bit invert register -------- */
#define DMT_DMTCLRINV_RESETVALUE              _UINT32_(0x00)                                       /*  (DMT_DMTCLRINV) Bit invert register  Reset Value */

#define DMT_DMTCLRINV_Msk                     _UINT32_(0x00000000)                                 /* (DMT_DMTCLRINV) Register Mask  */


/* -------- DMT_DMTSTAT : (DMT Offset: 0x30) (R/W 32)  -------- */
#define DMT_DMTSTAT_RESETVALUE                _UINT32_(0x00)                                       /*  (DMT_DMTSTAT)   Reset Value */

#define DMT_DMTSTAT_WINOPN_Pos                _UINT32_(0)                                          /* (DMT_DMTSTAT)  Position */
#define DMT_DMTSTAT_WINOPN_Msk                (_UINT32_(0x1) << DMT_DMTSTAT_WINOPN_Pos)            /* (DMT_DMTSTAT)  Mask */
#define DMT_DMTSTAT_WINOPN(value)             (DMT_DMTSTAT_WINOPN_Msk & (_UINT32_(value) << DMT_DMTSTAT_WINOPN_Pos)) /* Assigment of value for WINOPN in the DMT_DMTSTAT register */
#define DMT_DMTSTAT_DMTEVENT_Pos              _UINT32_(5)                                          /* (DMT_DMTSTAT)  Position */
#define DMT_DMTSTAT_DMTEVENT_Msk              (_UINT32_(0x1) << DMT_DMTSTAT_DMTEVENT_Pos)          /* (DMT_DMTSTAT)  Mask */
#define DMT_DMTSTAT_DMTEVENT(value)           (DMT_DMTSTAT_DMTEVENT_Msk & (_UINT32_(value) << DMT_DMTSTAT_DMTEVENT_Pos)) /* Assigment of value for DMTEVENT in the DMT_DMTSTAT register */
#define DMT_DMTSTAT_BAD_Pos                   _UINT32_(6)                                          /* (DMT_DMTSTAT)  Position */
#define DMT_DMTSTAT_BAD_Msk                   (_UINT32_(0x3) << DMT_DMTSTAT_BAD_Pos)               /* (DMT_DMTSTAT)  Mask */
#define DMT_DMTSTAT_BAD(value)                (DMT_DMTSTAT_BAD_Msk & (_UINT32_(value) << DMT_DMTSTAT_BAD_Pos)) /* Assigment of value for BAD in the DMT_DMTSTAT register */
#define DMT_DMTSTAT_Msk                       _UINT32_(0x000000E1)                                 /* (DMT_DMTSTAT) Register Mask  */


/* -------- DMT_DMTSTATCLR : (DMT Offset: 0x34) (R/W 32) Bit clear register -------- */
#define DMT_DMTSTATCLR_RESETVALUE             _UINT32_(0x00)                                       /*  (DMT_DMTSTATCLR) Bit clear register  Reset Value */

#define DMT_DMTSTATCLR_Msk                    _UINT32_(0x00000000)                                 /* (DMT_DMTSTATCLR) Register Mask  */


/* -------- DMT_DMTSTATSET : (DMT Offset: 0x38) (R/W 32) Bit set register -------- */
#define DMT_DMTSTATSET_RESETVALUE             _UINT32_(0x00)                                       /*  (DMT_DMTSTATSET) Bit set register  Reset Value */

#define DMT_DMTSTATSET_Msk                    _UINT32_(0x00000000)                                 /* (DMT_DMTSTATSET) Register Mask  */


/* -------- DMT_DMTSTATINV : (DMT Offset: 0x3C) (R/W 32) Bit invert register -------- */
#define DMT_DMTSTATINV_RESETVALUE             _UINT32_(0x00)                                       /*  (DMT_DMTSTATINV) Bit invert register  Reset Value */

#define DMT_DMTSTATINV_Msk                    _UINT32_(0x00000000)                                 /* (DMT_DMTSTATINV) Register Mask  */


/* -------- DMT_DMTCNT : (DMT Offset: 0x40) (R/W 32)  -------- */
#define DMT_DMTCNT_RESETVALUE                 _UINT32_(0x00)                                       /*  (DMT_DMTCNT)   Reset Value */

#define DMT_DMTCNT_COUNTER_Pos                _UINT32_(0)                                          /* (DMT_DMTCNT)  Position */
#define DMT_DMTCNT_COUNTER_Msk                (_UINT32_(0xFFFFFFFF) << DMT_DMTCNT_COUNTER_Pos)     /* (DMT_DMTCNT)  Mask */
#define DMT_DMTCNT_COUNTER(value)             (DMT_DMTCNT_COUNTER_Msk & (_UINT32_(value) << DMT_DMTCNT_COUNTER_Pos)) /* Assigment of value for COUNTER in the DMT_DMTCNT register */
#define DMT_DMTCNT_Msk                        _UINT32_(0xFFFFFFFF)                                 /* (DMT_DMTCNT) Register Mask  */


/* -------- DMT_DMTCNTCLR : (DMT Offset: 0x44) (R/W 32) Bit clear register -------- */
#define DMT_DMTCNTCLR_RESETVALUE              _UINT32_(0x00)                                       /*  (DMT_DMTCNTCLR) Bit clear register  Reset Value */

#define DMT_DMTCNTCLR_Msk                     _UINT32_(0x00000000)                                 /* (DMT_DMTCNTCLR) Register Mask  */


/* -------- DMT_DMTCNTSET : (DMT Offset: 0x48) (R/W 32) Bit set register -------- */
#define DMT_DMTCNTSET_RESETVALUE              _UINT32_(0x00)                                       /*  (DMT_DMTCNTSET) Bit set register  Reset Value */

#define DMT_DMTCNTSET_Msk                     _UINT32_(0x00000000)                                 /* (DMT_DMTCNTSET) Register Mask  */


/* -------- DMT_DMTCNTINV : (DMT Offset: 0x4C) (R/W 32) Bit invert register -------- */
#define DMT_DMTCNTINV_RESETVALUE              _UINT32_(0x00)                                       /*  (DMT_DMTCNTINV) Bit invert register  Reset Value */

#define DMT_DMTCNTINV_Msk                     _UINT32_(0x00000000)                                 /* (DMT_DMTCNTINV) Register Mask  */


/* -------- DMT_DMTHOLDREG : (DMT Offset: 0x50) (R/W 32)  -------- */
#define DMT_DMTHOLDREG_RESETVALUE             _UINT32_(0x00)                                       /*  (DMT_DMTHOLDREG)   Reset Value */

#define DMT_DMTHOLDREG_UPRCNT_Pos             _UINT32_(0)                                          /* (DMT_DMTHOLDREG)  Position */
#define DMT_DMTHOLDREG_UPRCNT_Msk             (_UINT32_(0xFFFF) << DMT_DMTHOLDREG_UPRCNT_Pos)      /* (DMT_DMTHOLDREG)  Mask */
#define DMT_DMTHOLDREG_UPRCNT(value)          (DMT_DMTHOLDREG_UPRCNT_Msk & (_UINT32_(value) << DMT_DMTHOLDREG_UPRCNT_Pos)) /* Assigment of value for UPRCNT in the DMT_DMTHOLDREG register */
#define DMT_DMTHOLDREG_Msk                    _UINT32_(0x0000FFFF)                                 /* (DMT_DMTHOLDREG) Register Mask  */


/* -------- DMT_DMTHOLDREGCLR : (DMT Offset: 0x54) (R/W 32) Bit clear register -------- */
#define DMT_DMTHOLDREGCLR_RESETVALUE          _UINT32_(0x00)                                       /*  (DMT_DMTHOLDREGCLR) Bit clear register  Reset Value */

